name: "pre_text_rec"
backend: "python"
max_batch_size: 8
input [
{
    name: "dt_boxes"
    data_type: TYPE_FP32
    dims: [4,2]
},
{
    name: "images"
    data_type: TYPE_UINT8
    dims: [-1,-1,3]
}
]
output [
{
    name: "pre_rec_output"
    data_type: TYPE_FP32
    dims: [3,48,-1]
}
]

instance_group [
{
    count: 1
    kind: KIND_GPU
}
]